export const HOUR_TIME = [
    "0時",
    "1時",
    "2時",
    "3時",
    "4時",
    "5時",
    "6時",
    "7時",
    "8時",
    "9時",
    "10時",
    "11時",
    "12時",
    "13時",
    "14時",
    "15時",
    "16時",
    "17時",
    "18時",
    "19時",
    "20時",
    "21時",
    "22時",
    "23時",
]

export const MINUTE_TIME = [
    "00分",
    "05分",
    "10分",
    "15分",
    "20分",
    "25分",
    "30分",
    "35分",
    "40分",
    "45分",
    "50分",
    "55分",
];

export const CONTENTS_LIST = [
    "一教",
    "二教",
    "三教",
    "四教",
    "四方投げ",
    "入り身投げ",
    "小手返し",
    "回転投げ",
    "腰投げ",
    "呼吸投げ",
    "隅落とし",
    "天地投げ",
    "呼吸法",
    "多人数",
    "武器技",
    "その他",
];

export const techniqueColors: { [techniqueName: string]: string } = {
    "一教": "#3498db", // 明るい青
    "二教": "#2ecc71", // 明るい緑
    "三教": "#9b59b6", // 明るい紫
    "四教": "#e74c3c", // 明るい赤
    "四方投げ": "#f1c40f", // 明るい黄色
    "入り身投げ": "#1abc9c", // シアン
    "小手返し": "#34495e", // 濃い青
    "回転投げ": "#d35400", // 明るいオレンジ
    "腰投げ": "#7f8c8d", // グレー
    "呼吸投げ": "#95a5a6", // 明るいグレー
    "隅落とし": "#2980b9", // 濃い青
    "天地投げ": "#8e44ad", // 濃い紫
    "呼吸法": "#27ae60", // 濃い緑
    "多人数": "#16a085", // 濃いシアン
    "武器技": "#c0392b", // 濃い赤
    "その他": "#bdc3c7", // シルバー
};